/* The label on the Cancel button in the assertion-failure & throw alerts */
"Abort" = "Avorter";

/* The default name for an undoable action. */
"Action" = "Action";

/* Menu item text that allows user to choose all files that can be read by the application. */
"All Readable Files" = "Tous les documents lisibles";

/* The message displayed in the assertion-failure alert */
"Assert Message" = "Condition: %1%\n\nFonction: %2%\nFichier: %3%\nLigne # %4%";

/* The title of the assertion-failure alert */
"Asssertion Failed" = "Asssertion échouée";

/* Error message when a property list file can't be read. */
"B::PropertyListCreateException" = "Incapable de lire un fichier de propriétés.";

/* Generic message when a bad-format-string exception occurs in the  boost format library. */
"boost::bad_format_string" = "Chaîne de format incorrecte.";

/* Generic message when an exception occurs in the  boost format library. */
"boost::format_error" = "Erreur inconnue de boost::format.";

/* Generic message when a out-of-range exception occurs in the  boost format library. */
"boost::out_of_range" = "Valeur hors-norme dans une chaîne de format.";

/* Generic message when a too-few-arguments exception occurs in the  boost format library. */
"boost::too_few_args" = "Trop peu d'arguments furent fournis à une chaîne de format.";

/* Generic message when a too-many-arguments exception occurs in the  boost format library. */
"boost::too_many_args" = "Trop d'arguments furent fournis à une chaîne de format.";

/* Displayed when there's nothing to redo */
"Can't Redo" = "Impossible de rétablir";

/* Displayed when there's nothing to undo */
"Can't Undo" = "Impossible d’annuler";

/* The label on the OK button in the assertion-failure & throw alerts */
"Continue" = "Continuer";

/* The title of the exception-throwing debug alert */
"Exception Thrown" = "Exception lancée";

/* The default accessibility description for Help buttons. */
"HelpButtonAXDescription" = "Aide";

/* An error message describing an out-of-memory situation. */
"Out of memory" = "Plus de mémoire";

/* The label on the Quiet button in the assertion-failure & throw alerts */
"Quiet" = "Muet";

/* Generic 'Redo' menu item text */
"Redo" = "Rétablir";

/* Default 'Redo' menu item text when there's a specific action to redo.  %1% holds the name of the action */
"Redo %1%" = "Rétablir %1%";

/* Generic message when a domain exception occurs. */
"std::domain_error" = "Erreur inconnue de domaine.";

/* Generic message when an exception occurs. */
"std::exception" = "Erreur inconnue.";

/* Generic message when an invalid-argument exception occurs. */
"std::invalid_argument" = "Argument invalide.";

/* Generic message when an I/O exception occurs. */
"std::ios_base::failure" = "Erreur d’entrée/sortie.";

/* Generic message when a length exception occurs. */
"std::length_error" = "Taille trop grande.";

/* Generic message when a logic exception occurs. */
"std::logic_error" = "Erreur de logique inconnue.";

/* Generic message when an out-of-range exception occurs. */
"std::out_of_range" = "Valeur hors-norme.";

/* Generic message when an overflow exception occurs. */
"std::overflow_error" = "Dépassement de capacité.";

/* Generic message when a range exception occurs. */
"std::range_error" = "Erreur inconnue d'étendue.";

/* Generic message when a runtime exception occurs. */
"std::runtime_error" = "Erreur d’exécution inconnue.";

/* Generic message when an underflow exception occurs. */
"std::underflow_error" = "Soupassement de capacité.";

/* The message displayed in the exception-throwing debug alert */
"Throw Message" = "Message: %1%\nQuoi: %2%\nErreur: %3%\n\nFonction: %4%\nFichier: %5%\nLigne # %6%";

/* Default 'Undo' menu item text when there's a specific action to undo.  %1% holds the name of the action */
"Undo %1%" = "Annuler %1%";

/* Generic 'Undo' menu item text */
"Undo" = "Annuler";

/* An error message displayed when something went wrong but we don't know what. */
"Unknown exception" = "Erreur inconnue.";

/* the name of the untitled documents after the first */
"untitled %1%" = "sans titre %1%";

/* the name of the first untitled document */
"untitled" = "sans titre";
